package com.rtmap.locationcheck.util;

public class PoiClassify {

	// 一级分类值
	public static String[] country = new String[] { "零售专卖", "餐饮", "休闲娱乐",
			"配套服务" };

	// 二级分类值
	public static String[][] province = new String[][] {
			{ "服装", "穿戴配饰", "运动户外", "儿童用品", "黄金珠宝", "化妆品", "数码电器", "家庭用品",
					"快消品", "品类集合店" }, { "快餐", "简餐", "正餐", "休闲饮品", "特色美食" },
			{ "影城", "养生保健", "游戏游艺", "运动健身" }, { "生活服务", "公共服务", "教育培训","其它" } };

	// 二级分类细分
	public static String[][] city = new String[][] {
			{ "男装，女装，男女装，内衣，鞋", "箱包，手表，眼镜，饰品，帽子，围巾", "运动，户外，装备，器械", "童装，玩具，母婴",
					"金银，钻石，珠宝", "护肤，彩妆，香水", "手机，电脑，大家电，小家电，数码周边",
					"家居，家纺，厨房，家具，图书", "食品饮料，日用品，生鲜蔬果，烟酒糖茶，保健品",
					"超市，电器，服装，运动，居家，奢侈品" },
			{ "中式快餐，西式快餐", "中式简餐，西式简餐", "中式正餐，西式正餐，自助餐", "咖啡，茶饮，甜品饮料，酒吧",
					"火锅，日韩料理，烤肉，地方小吃" },
			{ "IMAX，连锁，地方", "美容，美发，美甲，足浴桑拿，中医保健，香蕉SPA",
					"电玩城，儿童乐园，桌球，KTV夜店，棋牌麻将", "健身房，瑜伽，溜冰场，射箭" },
			{ "维护保养，影楼，药店，旅行社，宠物服务，互联网", "银行，通讯，快递，网吧，票务", "智力开发，体育运动，艺术形体" ,"未知，装修，停车场编号等"}, };
}
