package com.rtmap.wifipicker.util;

public class PoiClassify {

    // 一级分类值
    public static String[] province = new String[] { "餐饮", "购物", "服务", "娱乐健身" };
   
    // 二级分类值
    public static String[][] city = new String[][] {
            { "中餐", "西餐", "咖啡", "茶馆", "食品店", "冷饮", "酒吧", "其他" },
            { "服装服饰", "鞋", "帽", "箱包", "户外用品", "运动品牌", "化妆品", "珠宝首饰", "儿童用品", "孕婴用品", "美容美发", "数码电子", "书店", "文化用品店",
                    "药店", "保健品", "体育用品", "礼品店", "超市、便利店", "建材", "家居", "家具", "花店", "其他" }, 
            { "邮政", "保险", "汽车美容", "摄影冲洗", "典当行", "彩票站", "金融设施", "宠物服务", "教育", "交通", "洗衣店", "钟表维修", "衣服修改", "其他" },
            { "KTV", "网吧", "电影院", "电玩", "游泳馆", "滑冰场", "洗浴桑拿", "健身中心", "其他" }
            };

    // 三级分类值
    public static String[][][] county = new String[][][] { 
            { 
               { "中式快餐", "火锅", "茶餐厅", "川菜", "粤菜", "湘菜", "东北菜", "自助", "湖北菜", "江浙菜", "清真菜", "西北菜", "云南菜", "贵州菜", "素菜", "海鲜", "烧烤", "安徽菜", "山东菜", "福建菜", "其他" }, 
               { "西餐", "西式快餐", "日本料理", "韩国料理", "东南亚菜", "其他" }, 
               { "无" }, 
               { "无" }, 
               { "甜点", "面包房", "蛋糕房", "其他" }, 
               { "无" }, 
               { "无" }, 
               { "无" }
            }, 
            
            {
               { "服装服饰", "男装", "女装", "内衣店", "毛绒类", "羽绒", "皮草", "名族服饰", "童装" }, 
               { "男鞋", "女鞋", "童鞋", "休闲鞋", "其他" }, 
               { "无" }, 
               { "无" }, 
               { "无" },
               { "健身器材", "校园体育器材", "康体器材", "竞赛项目用品", "运动护具", "运动服饰", "户外运动休闲用品", "体育场馆", "其他体育用品", "家用系列", "其他" }, 
               { "一般化妆品", "婴儿化妆品", "少年化妆品", "孕妇化妆品", "其他" }, 
               { "贵金属类", "珠宝类", "配饰类", "民族宗教类", "银饰", "其他", "羽绒", "皮草", "童装" }, 
               { "玩具", "学习用品", "洗护用品", "其他" }, 
               { "无" },
               { "无" }, 
               { "通讯", "家用电器", "数码产品", "其他" }, 
               { "无" }, 
               { "无" }, 
               { "无" },
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "板材", "瓷砖", "辅料", "其他" },
               { "厨房用品", "卫生间用品", "卧室用品", "客厅用品", "其他" }, 
               { "客厅家具", "过道家具", "卧室家具", "厨房家具", "餐厅家具", "卫生间家具", "书房家具", "门厅家具", "实木家具", "板式家具", "软体家具", "金属家具", "办公家具", "民用家具", "公共家具", "现代家具", "古典家具", "其他" }, 
               { "无" }, 
               { "无" }
            }, 
            
            {
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" },
               { "无" }, 
               { "银行", "ATM", "收银台", "收费站", "其他" }, 
               { "无" }, 
               { "无" }, 
               { "无" },
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" }
            }, 
            
            {
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" },
               { "无" }, 
               { "无" }, 
               { "无" }, 
               { "无" }
               
            } 
            
        };
    
    // 四级分类
    public static String[][][][] fourthStrs = new String[][][][] {
            
            { 
                { {"饭食类", "面食类", "面点类", "饮料小吃类"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                { {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                { {"无"} }, 
                { {"无"} }, 
                { {"无"}, {"无"}, {"无"}, {"无"} }, 
                { {"无"} }, 
                { {"无"} }, 
                { {"无"} }
             }, 
             {
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"} }, 
                 { {"无"} }, 
                 { {"无"} },
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"藏饰品", "云南饰品", "苗银饰品", "外国饰品", "复古饰品"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, /////////
                 { {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"} },
                 { {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"} }, 
                 { {"无"} }, 
                 { {"无"} },
                 { {"无"} }, 
                 { {"无"} }, 
                 { {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"} },
                 { {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                 { {"无"} }, 
                 { {"无"} }
              }, 
              {
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} },
                  { {"无"} }, 
                  { {"无"}, {"无"}, {"无"}, {"无"}, {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} },
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }
               }, 
               
               {
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} },
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }, 
                  { {"无"} }
                  
               } 
            
            };
    

}
